# SetTextStyleByClassN

## Description
SetTextStyleByClassN sets a specified substring of a text object to use the class text style. To undo this, use SetTextStyleRef or SetTextStyleRefN on the text.

```pascal
FUNCTION SetTextStyleByClassN(
				objectId : HANDLE;
				start    : INTEGER;
				count    : INTEGER) : BOOLEAN;
```

```python

def vs.SetTextStyleByClassN(objectId, start, count):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectId|HANDLE|handle to text object|
|start|INTEGER|Start position in text string, zero-based.|
|count|INTEGER|Length of substring.|

## Returns
Returns False if object is not a text object, or if part of the substring is past the end of existing text. Otherwise returns true.

## See Also
VS Functions:
SetTextStyleRef| GetTextStyleRef| SetTextStyleRefN| GetTextStyleRefN| SetTextStyleByClass| SetTextStyleByClassN| IsTextStyleByClass| IsTextStyleByClassN

## Version
Availability: from Vectorworks 2015
## Category
* Objects - Text